<template>
  <ve-histogram :data="chartData" :settings="chartSettings"></ve-histogram>
</template>

<script>
  module.exports = {
    created: function () {
      this.chartData = {
        columns: ['日期', '稿件量', '阅读量', '占比', '其他'],
        rows: [
          { '日期': '1月1日', '稿件量': 1523, '阅读量': 1523, '占比': 0.12, '其他': 100 },
          { '日期': '1月2日', '稿件量': 1223, '阅读量': 1921, '占比': 0.345, '其他': 100 },
          { '日期': '1月3日', '稿件量': 2123, '阅读量': 5523, '占比': 0.7, '其他': 100 },
          { '日期': '1月4日', '稿件量': 4123, '阅读量': 2213, '占比': 0.31, '其他': 100 },
          { '日期': '1月5日', '稿件量': 1853, '阅读量': 5523, '占比': 0.5, '其他': 100 },
          { '日期': '1月6日', '稿件量': 2654, '阅读量': 5432, '占比': 0.6, '其他': 100 }
        ]
      }
      this.chartSettings = {
        metrics: ['稿件量', '阅读量'],
        showLine: ['阅读量']
      }
    }
  }
</script>